# Data Analysis

## Setup

In [1]:
import pandas as pd
import numpy as np

path_preproccesed = '../data/preprocessed.csv'

In [2]:
df = pd.read_csv(path_preproccesed)
df.head()

,property_id,building,date_sale,type,property#,area,price,status,customerid,entity,...,birth_date,sex,country,state,purpose,deal_satisfaction,mortgage,source_Agency,source_Client,source_Website
0,1030,1,2005-11-01,1,30,743.09,246172.68,1,C0028,0.0,...,1986-06-21,1.0,USA,California,0.0,5.0,0.0,False,False,True
1,1029,1,2005-10-01,1,29,756.21,246331.90,1,C0027,0.0,...,1983-02-24,1.0,USA,California,0.0,5.0,0.0,False,False,True
2,2002,2,2007-07-01,1,2,587.28,209280.91,1,C0112,0.0,...,1985-12-27,0.0,USA,California,0.0,1.0,1.0,False,True,False
3,2031,2,2007-12-01,1,31,1604.75,452667.01,1,C0160,0.0,...,1985-12-27,0.0,USA,California,1.0,3.0,1.0,False,False,True
4,1049,1,2004-11-01,1,49,1375.45,467083.31,1,C0014,0.0,...,1979-05-15,1.0,USA,California,0.0,4.0,0.0,True,False,False

In [3]:
df.shape

(267, 22)

---

## Analysis

The aim is to understand the distribution of the key variables to answer the following questions:
- What are the sales and overall performance by building type?
- What are the sales and overall performance by country and state?

### `Building`

There are 5 types of buildings in the dataset.

In [4]:
set(df['building'])

{1, 2, 3, 4, 5}

In order to examine the totals by building types, we study the total number of sold properties and how many of them had mortgages per building type.

In [6]:
buildings_df = df[['building', 'mortgage', 'status']]

In [14]:
sold_buildings_df = buildings_df.loc[df['status'] == 1].drop('status', axis=1).copy()
sold_buildings_df

     building  mortgage
0           1       0.0
1           1       0.0
2           2       1.0
3           2       1.0
4           1       0.0
..        ...       ...
191         1       0.0
192         1       0.0
193         1       0.0
194         1       0.0
195         1       0.0

[195 rows x 2 columns]

In [15]:
sold_buildings_df.groupby('building').count()

          mortgage
building
1               46
2               54
3               53
4               23
5               19

This indicates that there are 54 type 2 buildings sold.

In [16]:
sold_buildings_df.groupby('building').sum()

          mortgage
building
1             14.0
2             18.0
3             15.0
4              9.0
5              6.0

It is important to remember that each `Yes` in the column `mortgage` is 1. Consequently, we can observe that type 2 buildings have the most amount of mortgages, whereas type 5 building the least amount.